app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  ORDER BY updated_at DESC  [["post_id", 1]]
---
  <% end %>
  <% @post.comments.each do |comment| %>