app/controllers/meetings_controller.rb

  def create
    @meeting = Meeting.new(meeting_params)

    respond_to do |format|
      if @meeting.save
---
INSERT INTO "meetings" ("name", "event", "start_time", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Project 2 is due"], ["event", "Screencasting"], ["start_time", "2016-03-24 11:00:00.000000"], ["created_at", "2016-03-23 17:46:37.107414"], ["updated_at", "2016-03-23 17:46:37.107414"]]

  def update
    respond_to do |format|
      if @meeting.update(meeting_params)
---
UPDATE "meetings" SET "event" = $1, "updated_at" = $2 WHERE "meetings"."id" = $3  [["event", "5x5 Bench press\r\n5x5 Squats\r\n5x5 Deadlift\r\n\r\nall kinds of gainz"], ["updated_at", "2016-03-23 18:44:43.135931"], ["id", 5]]

  def destroy
    @meeting.destroy
---
DELETE FROM "meetings" WHERE "meetings"."id" = $1  [["id", 1]]