app/controllers/photos_controller.rb

INSERT INTO "photos" ("title", "photo_url", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save